package by.module1.main;

public class Module1Char {
/* Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера */
    public static void main(String args[]){
        for(int i=0; i<=255; i++){
            System.out.print((char)i);
            }
    }
}
